# Manipulação EDA da base de dados Titanic

## Importando pacotes e bibliotecas

In [111]:
from matplotlib import pyplot as plt
import seaborn as sas
import pandas as pd
import numpy as np
#---
from utils.tratar_dados import *
from utils.funcoes_graficas import *

## Importando base de dados

### Importando de um .csv

In [112]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

### Importando de um .pkl

In [113]:
file_name = "titanic"
titanic_dataframe = read_data(file_name)

Read from .pkl file format

## Tratamento dos dados

### Passando os títulos para minúsculo

In [114]:
titulos = titanic_dataframe.columns
titulos = fix_header_to_standarts(titulos)
titanic_dataframe.columns = titulos

### Remoção de espaços

In [115]:
# Nao foi necessario

### Remoção de caracteres proibidos

In [116]:
# Nao foi necessario

### Normalização dos dados

In [117]:
titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    int64
 1   survived     418 non-null    int64
 2   pclass       418 non-null    int64
 3   name         418 non-null    object
 4   sex          418 non-null    object
 5   age          332 non-null    float64
 6   sibsp        418 non-null    int64
 7   parch        418 non-null    int64
 8   ticket       418 non-null    object
 9   fare         417 non-null    float64
 10  cabin        91 non-null     object
 11  embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [118]:
titanic_dataframe.sample(10)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
27,919,0,3,"Daher, Mr. Shedid",male,22.5,0,0,2698,7.2250,NaN,C
389,1281,0,3,"Palsson, Master. Paul Folke",male,6.0,3,1,349909,21.0750,NaN,S
379,1271,0,3,"Asplund, Master. Carl Edgar",male,5.0,4,2,347077,31.3875,NaN,S
371,1263,1,1,"Wilson, Miss. Helen Alice",female,31.0,0,0,16966,134.5000,E39 E41,C
233,1125,0,3,"Linehan, Mr. Michael",male,NaN,0,0,330971,7.8792,NaN,Q
241,1133,1,2,"Christy, Mrs. (Alice Frances)",female,45.0,0,2,237789,30.0000,NaN,S
25,917,0,3,"Robins, Mr. Alexander A",male,50.0,1,0,A/5. 3337,14.5000,NaN,S
35,927,0,3,"Katavelas, Mr. Vassilios (Catavelas Vassilios"")""",male,18.5,0,0,2682,7.2292,NaN,C
150,1042,1,1,"Earnshaw, Mrs. Boulton (Olive Potter)",female,23.0,0,1,11767,83.1583,C54,C
347,1239,1,3,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C

#### Tratamento de NaNs

##### Coluna "cabin"

In [119]:
coluna_cabine = "cabin"
for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna("unknown")


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
176,1068,1,2,"Sincock, Miss. Maude",female,20.0,0,0,C.A. 33112,36.7500,unknown,S
274,1166,0,3,"Saade, Mr. Jean Nassr",male,NaN,0,0,2676,7.2250,unknown,C
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
356,1248,1,1,"Brown, Mrs. John Murray (Caroline Lane Lamson)",female,59.0,2,0,11769,51.4792,C101,S
253,1145,0,3,"Salander, Mr. Karl Johan",male,24.0,0,0,7266,9.3250,unknown,S

In [120]:
titanic_dataframe.cabin = fix_header_to_standarts(titanic_dataframe.cabin.values)

##### Coluna "age"

In [121]:
coluna_cabine = "age"
media = int(round(titanic_dataframe.age.mean(), 0))

for coluna in titanic_dataframe.columns:
    if coluna_cabine == coluna:
        titanic_dataframe[f"{coluna}"] = titanic_dataframe[f"{coluna}"].fillna(media)


titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
53,945,1,1,"Fortune, Miss. Ethel Flora",female,28.0,3,2,19950,263.0000,c23_c25_c27,S
135,1027,0,3,"Carlsson, Mr. Carl Robert",male,24.0,0,0,350409,7.8542,unknown,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,e31,S
63,955,1,3,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,unknown,Q
397,1289,1,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.0,1,1,13567,79.2000,b41,C

##### Coluna "embarked"

In [122]:
titanic_dataframe.embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [123]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.embarked = titanic_dataframe.embarked.map({
    "C": 0,
    "Q": 1,
    "S": 2
    }
)

In [124]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
28,920,0,1,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,a21,2
358,1250,0,3,"O'Keefe, Mr. Patrick",male,30.0,0,0,368402,7.7500,unknown,1
109,1001,0,2,"Swane, Mr. George",male,18.5,0,0,248734,13.0000,f,2
391,1283,1,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,51.0,0,1,PC 17592,39.4000,d28,2
283,1175,1,3,"Touma, Miss. Maria Youssef",female,9.0,1,1,2650,15.2458,unknown,0

##### Coluna "sex"

In [125]:
titanic_dataframe.sex.unique()

array(['male', 'female'], dtype=object)

In [126]:
# NAO EXECUTE ESSA CELUNA MAIS DE UMA UNICA VEZ
titanic_dataframe.sex = titanic_dataframe.sex.map({
    "male": 0,
    "female": 1
    }
)

In [127]:
titanic_dataframe.sample(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
178,1070,1,2,"Becker, Mrs. Allen Oliver (Nellie E Baumgardner)",1,36.0,0,3,230136,39.0000,f4,2
177,1069,0,1,"Stengel, Mr. Charles Emil Henry",0,54.0,1,0,11778,55.4417,c116,0
322,1214,0,2,"Nesson, Mr. Israel",0,26.0,0,0,244368,13.0000,f2,2
330,1222,1,2,"Davies, Mrs. John Morgan (Elizabeth Agnes Mary...",1,48.0,0,2,C.A. 33112,36.7500,unknown,2
125,1017,1,3,"Cribb, Miss. Laura Alice",1,17.0,0,1,371362,16.1000,unknown,2

#### Tratamento de tipos

In [128]:
id_max = titanic_dataframe.passengerid.max()
fare_max = round(titanic_dataframe.fare.max(), 2)
print(f"O maior id é:\t\t{id_max}\nA maior tarifa é:\t{fare_max}\n")

O maior id é:		1309
A maior tarifa é:	512.33

In [129]:
### coluna passengerid
titanic_dataframe.passengerid = titanic_dataframe.passengerid.astype("uint16")

### coluna survided
titanic_dataframe.survived = titanic_dataframe.survived.astype("uint8")

### coluna pclass
titanic_dataframe.pclass = titanic_dataframe.pclass.astype("uint8")

### coluna name
titanic_dataframe.name = titanic_dataframe.name.astype("category")

### coluna sex
titanic_dataframe.sex = titanic_dataframe.sex.astype("uint8")

### coluna age
titanic_dataframe.age = titanic_dataframe.age.astype("uint8")

### coluna sibsp
titanic_dataframe.sibsp = titanic_dataframe.sibsp.astype("uint8")

### coluna parch
titanic_dataframe.parch = titanic_dataframe.parch.astype("uint8")

### coluna ticket
titanic_dataframe.ticket = titanic_dataframe.ticket.astype("category")

### coluna fare
titanic_dataframe.fare = titanic_dataframe.fare.astype("float16")
# titanic_dataframe.fare = titanic_dataframe["fare"].apply(np.floor)

### coluna cabin
titanic_dataframe.cabin = titanic_dataframe.cabin.astype("category")

### coluna embarked
titanic_dataframe.embarked = titanic_dataframe.embarked.astype("uint8")

In [130]:
titanic_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    uint16
 1   survived     418 non-null    uint8
 2   pclass       418 non-null    uint8
 3   name         418 non-null    category
 4   sex          418 non-null    uint8
 5   age          418 non-null    uint8
 6   sibsp        418 non-null    uint8
 7   parch        418 non-null    uint8
 8   ticket       418 non-null    category
 9   fare         417 non-null    float16
 10  cabin        418 non-null    category
 11  embarked     418 non-null    uint8
dtypes: category(3), float16(1), uint16(1), uint8(7)
memory usage: 39.7 KB

#### Exclusão de colunas inconclusívas

##### Coluna "name"

In [131]:
titanic_dataframe = titanic_dataframe.drop(["name"], axis=1)
titanic_dataframe.sample(5)

,passengerid,survived,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked
404,1296,0,1,0,43,1,0,17765,27.71875,d40,0
250,1142,1,2,1,0,1,2,C.A. 34651,27.75000,unknown,2
217,1109,0,1,0,57,1,1,36928,164.87500,unknown,2
184,1076,1,1,1,27,1,1,PC 17558,247.50000,b58_b60,0
183,1075,0,3,0,30,0,0,7935,7.75000,unknown,1

##### Coluna "ticket"

In [132]:
titanic_dataframe = titanic_dataframe.drop(["ticket"], axis=1)
titanic_dataframe.sample(5)

,passengerid,survived,pclass,sex,age,sibsp,parch,fare,cabin,embarked
150,1042,1,1,1,23,0,1,83.187500,c54,0
0,892,0,3,0,34,0,0,7.828125,unknown,1
92,984,1,1,1,27,1,2,52.000000,b71,2
404,1296,0,1,0,43,1,0,27.718750,d40,0
313,1205,1,3,1,37,0,0,7.750000,unknown,1

##### Coluna "cabin"

In [133]:
titanic_dataframe = titanic_dataframe.drop(["cabin"], axis=1)
titanic_dataframe.sample(5)

,passengerid,survived,pclass,sex,age,sibsp,parch,fare,embarked
337,1229,0,3,0,39,0,2,7.230469,0
315,1207,1,3,1,17,0,0,7.734375,1
175,1067,1,2,1,15,0,2,39.000000,2
277,1169,0,2,0,40,1,0,26.000000,2
50,942,0,1,0,24,1,0,60.000000,2

#### Resultado final

In [134]:
titanic_dataframe.info()

# Se quiser salvar descomentar bloco a seguir
#
#
# file_name = "titanic"
# save_pkl_file(titanic_dataframe, file_name)
#
#

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  418 non-null    uint16
 1   survived     418 non-null    uint8
 2   pclass       418 non-null    uint8
 3   sex          418 non-null    uint8
 4   age          418 non-null    uint8
 5   sibsp        418 non-null    uint8
 6   parch        418 non-null    uint8
 7   fare         417 non-null    float16
 8   embarked     418 non-null    uint8
dtypes: float16(1), uint16(1), uint8(7)
memory usage: 4.6 KB

## Extração dos dados

### Média

#### Coluna "age"

In [141]:
media_idade = round(titanic_dataframe.age.mean(), ndigits=1)
print(f"A média de idade é: {media_idade}\n")

A média de idade é: 30.2

#### Coluna "fare"

In [164]:
media_taxa = round(titanic_dataframe.fare.mean(), ndigits=2)
print(f"A média de taxa é: {media_taxa}\n")

A média de taxa é: 35.625

### Mediana

#### Coluna "age"

In [175]:
mediana_idade = titanic_dataframe.age.median()
print(f"A mediana de idade é: {mediana_idade}\n")

A mediana de idade é: 30.0

#### Coluna "fare"

In [178]:
mediana_taxa = titanic_dataframe.fare.median()
print(f"A mediana de taxa é: {round(mediana_taxa, 0)}\n")

A mediana de taxa é: 14.0

### Moda

#### Coluna "age"

In [181]:
moda_idade = titanic_dataframe.age.mode()
print(f"A moda de idade é: {moda_idade}\n")

A moda de idade é: 0    30
Name: age, dtype: uint8

#### Coluna "fare"

In [182]:
moda_taxa = titanic_dataframe.fare.mode()
print(f"A moda de taxa é: {moda_taxa}\n")

A moda de taxa é: 0    7.75
Name: fare, dtype: float16

### Desvio padrão

#### Coluna "age"

In [188]:
desvio_padrao_idade = round(titanic_dataframe.age.std(), 2)

if desvio_padrao_idade == np.Inf:
    print(f"O desvio padrão da idade é infinito\n")
else:
    print(f"O desvio padrão da idade é: {desvio_padrao_idade}\n")

O desvio padrão da idade é: 12.65

#### Coluna "fare"

In [189]:
desvio_padrao_taxa = round(titanic_dataframe.fare.std(), 2)

if desvio_padrao_taxa == np.Inf:
    print(f"O desvio padrão da taxa é infinito\n")
else:    
    print(f"O desvio padrão da taxa é: {desvio_padrao_taxa}\n")

O desvio padrão da taxa é infinito